## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 1 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

```python
# "Диагонали символами"
# Дана сторона квадрата. Вывести его диагонали символами #

a = int(input("Введите сторону квадрата a: "))

i = 0  # индекс строки в квадрате сверху вниз
k = 0  # позиция X в строке слева направо, и (а-k) - справа налево

while i < a:
    i += 1
    k += 1
    j = 0  # индекс символа в текущей строке
    st = ""  # строка для построения из пробелов и X
    while j <= a:
        j += 1
        if j == k or j == a + 1 - k:
            st += "X"
        else:
            st += " "

    print(st)

```
